'''
Ваш дядя — владелец фирмы, которая занимается ремонтом офисов. Он заподозрил, что бригадир закупает слишком много краски, и попросил вас разобраться.
Ваша задача — написать программу, которая рассчитывает минимальное количество банок краски, необходимых для покраски стен офиса.
Длина офиса — L метров, ширина — W метров, высота — H метров.
Одна банка краски покрывает 16 м² поверхности. Размеры дверей и окон можно игнорировать.
'''

import math
L, W, H = map(int, input().split())
pokraska = ((L + W) * H)/8
print(math.ceil(pokraska))