'''
Гарри и Ларри решили пострелять по банкам, выставленным на бревно. Они стреляли одновременно, но с разных сторон:

    ➖ Гарри стрелял слева направо;

    ➖ Ларри стрелял справа налево.

В какой-то момент их пули попали в одну и ту же последнюю банку, после чего стрельба прекратилась.

Теперь они спорят, кто кому должен деньги за то, что помешал насладиться стрельбой. Однако они не помнят, сколько банок было изначально, а лишь знают два значения a и b:

    ●    a — сколько банок успел прострелить Гарри;

    ●    b — сколько банок успел прострелить Ларри.

Ваша задача — определить:

    Сколько банок не успел прострелить Гарри;

    Сколько банок не успел прострелить Ларри.

'''